orchestrations/TvShows/src/Partners/CachedFeedReader.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="CachedFeedReader" targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/CachedFeedReader"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/CachedFeedReader" xmlns:ns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/CachedFeedReader" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/CachedFeedReader">
            <xsd:import namespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/CachedFeedReader" schemaLocation="CachedFeedReader.xsd"/>
        </xsd:schema>
    </types>
    <message name="CachedReadAFeedRequest">
        <part name="in" element="ns:CachedReadAFeedRequest"/>
    </message>
    <message name="CachedReadAFeedResponse">
        <part name="out" element="ns:CacheReadAFeedResponse"/>
    </message>
    <portType name="CachedFeedReaderPortType">
        <operation name="CachedReadAFeed">
            <input name="input1" message="tns:CachedReadAFeedRequest"/>
            <output name="output1" message="tns:CachedReadAFeedResponse"/>
        </operation>
    </portType>
    <binding name="CachedFeedReaderBinding" type="tns:CachedFeedReaderPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="CachedReadAFeed">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="CachedFeedReaderService">
        <port name="CachedFeedReaderPort" binding="tns:CachedFeedReaderBinding">
            <soap:address location="http://localhost:9080/CachedFeedReaderService/CachedFeedReaderPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="CachedFeedReader">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="CachedFeedReaderPortTypeRole" portType="tns:CachedFeedReaderPortType"/>
    </plnk:partnerLinkType>
</definitions>
