orchestrations/CachedFeedReaderComponent/test/Invoker/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cac="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/CachedFeedReader">
  <soapenv:Body>
    <cac:CachedReadAFeedRequest>
      <cac:feedName>tv-krinien.com</cac:feedName>
      <cac:validity>5</cac:validity>
    </cac:CachedReadAFeedRequest>
  </soapenv:Body>
</soapenv:Envelope>